Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ཤིན་ཏུ་བཀྲ་ཤིས་སྐར་མ་བཟང་།
en: Is very auspicious, and occurred under an auspicious constellation.

source: །དྲང་སྲོང་ཆེན་པོ་དེ་ཡི་ནི། །བསོད་ནམས་ལས་ཀྱི་མཐུ་འདིའོ།
en: This is due to the meritorious actions Of this great sage.”

source: །དེ་ལྟར་ཚོང་པ་བསྐུལ་ནས་ནི།
en: Once Śikhaṇḍī had inspired the merchants,

source: །རྨ་བྱ་རང་གི་གནས་སུ་སོང་།
en: He returned to his own abode.

source: །ག་གོན་ཞེས་ནི་བྱ་ལ་སོགས།
en: Trapuṣa and the others

source: །ཐམས་ཅད་ཡིད་ནི་མགུ་བར་གྱུར།
en: Were all elated.

source: །བ་སྟོང་འོ་མ་ཇི་སྙེད་ཡོད་པ་དག །དེ་ཀུན་མ་ལུས་པར་ནི་བསྡུས་ནས་སུ།
en: They combined without exception All the milk of one thousand cows,

source: །དེ་ཡི་སྟེང་ནས་པྲིས་མ་བཞམ་བྱས་ཏེ།
en: Collected the cream from the top,

source: །དེ་དག་རབ་ཏུ་གུས་པར་ཞལ་ཟས་སྦྱོར།
en: And respectfully prepared a meal.

source: །རིན་ཆེན་གཞོང་པ་ཚིམ་བྱེད་ཅེས་བྱ་བ།
en: They cleaned, polished, and sanitized

source: །སྲང་གཅིག་ལ་ཡང་འབུམ་ཕྲག་གཅིག་རི་བ། །གཙང་མར་རབ་བཀྲུས་དྲི་མ་མེད་བྱས་ནས།
en: A jewel bowl called Moon, Which cost one hundred thousand coins for just one ounce,

source: །ཞལ་ཟས་ཀྱིས་ནི་ཁ་ད་ཆད་དུ་བཀང་།
en: Then filled it to the brim with food.

source: །སྦྲང་རྩི་དང་ནི་རིན་ཆེན་གཞོང་ཐོགས་ཏེ།
en: Carrying honey and the jewel bowl,

source: །སྒྲོལ་རྒྱུའི་ཤིང་གི་དྲུང་སོང་སྟོན་པ་ལ།
en: They approached the trunk of the tree of liberation and said to the teacher,

source: །བཙུན་པ་བཞེས་ཏེ་བདག་ཅག་སྨན་ཡང་ཐོགས།
en: “Venerable One, please accept and receive us!

source: །ཞལ་ཟས་གྱ་ནོམ་པ་འདི་མན་བས་སུ་གསོལ།
en: We beg that you eat this well-prepared meal!”

source: །སྤུན་གཉིས་པོ་ལ་ཐུགས་བརྩེ་མཛད་པ་དང་། །བྱང་ཆུབ་ཞུགས་པའི་སྔོན་གྱི་བསམ་མཁྱེན་ནས།
en: Out of compassion for the two brothers, And because he was aware of their previous intent to set out toward awakening,

source: །སྟོན་པ་བཞེས་པ་མཛད་དེ་ཞལ་ཟས་གསོལ།
en: The Teacher accepted and ate the food.

source: །གསོལ་ནས་གཞོང་པ་ནམ་མཁའི་དཀྱིལ་དུ་བོར།
en: Once he had eaten, he tossed the bowl far into the sky.

source: །ལྷ་ཡི་བུ་ཕོ་རབ་ཚངས་ཞེས་བྱ་བ།
en: A divine king called Subrahman

source: །དེ་ཡིས་རིན་ཆེན་གཞོང་པ་མཆོག་དེ་བླངས།
en: Retrieved the supreme jewel bowl,

source: །དེས་དེ་ད་དུང་ཚངས་པའི་འཇིག་རྟེན་ན། །ལྷ་གཞན་གྲོགས་དང་ལྷན་ཅིག་མཆོད་པ་བྱེད།
en: And is still now performing worship with it In the Brahma realm, together with his companions.

source: །དེ་ནས་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པས་ཚོང་པ་ག་གོན་དང་བཟང་པོ་དེ་དག་ལ་འདི་དག་གིས་རབ་ཏུ་དགའ་བར་མཛད་དོ།
en: On that occasion, the Thus-Gone One delighted the merchants Trapuṣa and Bhallika tremendously with these verses:

source: །ལྷ་ཡི་བཀྲ་ཤིས་དོན་སྒྲུབ་ཅིང་།
en: “May divine auspiciousness, which accomplishes aims

source: །ཕྱོགས་རྣམས་བཀྲ་ཤིས་བྱེད་པ་དེས།
en: And brings good fortune throughout the ten directions,

source: །ཁྱེད་ཀྱི་དོན་རྣམས་གྲུབ་གྱུར་ཅིག །
en: Fulfill all your aims!

source: ཐམས་ཅད་མྱུར་དུ་འཐུན་པར་ཤོག
en: May everything promptly be favorable!

source: །ཕྲེང་བ་མགོ་ལ་འདུག་པ་ལྟར། །ལག་པ་གཡས་ན་དཔལ་ཡོད་ཤོག །གཡོན་ནའང་དཔལ་ནི་གནས་གྱུར་ཅིག །ཡན་ལག་ཀུན་ནའང་དཔལ་ཡོད་ཤོག །
en: “Like a garland around your neck, May there be glory at your right hand, May there be glory at your left hand, And may there be glory surrounding you!

source: ཚོང་པ་དག་ནི་ནོར་ཚོལ་ཞིང་།
en: “May the merchants who pursue wealth

source: །ཕྱོགས་བཅུ་དག་ཏུ་འགྲོ་བ་རྣམས།
en: And travel throughout the ten directions

source: །རྙེད་པ་ཆེན་པོ་རྙེད་གྱུར་ཅིང་།
en: Attain great profit,

source: །དེ་དག་བདེ་བ་སྐྱིད་པར་ཤོག །
en: And may that bring them happiness!

source: དགོས་པ་ལ་ལ་གང་གི་ཕྱིར།
en: “Should you, for some reason,

source: །ཤར་ཕྱོགས་སུ་ནི་འགྲོ་བ་ན།
en: Need to travel east,

source: །གང་དག་ཕྱོགས་དེར་གནས་པ་ཡི།
en: May the constellations in that direction

source: །རྒྱུ་སྐར་ཁྱེད་ལ་སྐྱོང་གྱུར་ཅིག །སྨིན་དྲུག་དང་ནི་སྣར་མ་དང་། །མགོ་དང་ལག་དང་ནབ་སོ་དང་། །རྒྱལ་དང་སྐག་ཅེས་བྱ་བ་སྟེ།
en: Protect you! “Kṛttikā and Rohiṇī, Mṛgaśirā, Ardra, and Punarvasu, Puṣya, and Aśleṣā—

source: །དེ་དག་རྣམས་ནི་ཤར་ཕྱོགས་པ།
en: These are the constellations in the east.

source: །རྒྱུ་སྐར་བདུན་པོ་དེ་དག་ནི།
en: “May these seven constellations,

source: །འཇིག་རྟེན་སྐྱོང་བ་གྲགས་ལྡན་པ།
en: Renowned world protectors,

source: །ཤར་ཕྱོགས་ལོགས་ན་ཡོད་ཅེས་བསྟན།
en: The gods that dwell in the east,

source: །དེ་དག་ཁྱེད་ལ་ཀུན་ཏུ་སྲུངས།
en: Fully protect you!

source: །དེ་དག་བདག་པོ་རྒྱལ་པོ་ནི།
en: “Their lord and king

source: །ཡུལ་འཁོར་སྲུང་ཞེས་གྲགས་པ་སྟེ།
en: Is known as Dhṛtarāṣṭra.

source: །དེ་ནི་དྲི་ཟ་ཀུན་གྱི་བདག །ཉི་མ་ལྷན་ཅིག་སྲུང་བར་ཤོག
en: May this lord of all gandharvas, Together with the sun, protect you!

source: །དེ་ལ་བུ་ནི་མང་ཡོད་ལ། །མཁས་ཤིང་མིང་ཡང་འཐུན་པ་སྟེ། །དགུ་བཅུ་རྩ་གཅིག་ཟད་པར་ཡང་། །དབང་པོ་ཞེས་བྱ་སྟོབས་པོ་ཆེ།
en: “May his many sons, wise and mighty, All ninety-one of whom are called Indra, Especially protect you With health and well-being!

source: །དེ་རྣམས་ཁྱེད་ལ་ནད་མེད་ཅིང་། །ཤིས་པར་ལྷག་པར་སྐྱོང་གྱུར་ཅིག །ཤར་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན། །ལྷ་མོ་གཞོན་ནུ་བརྒྱད་ཡོད་དེ། །རྒྱལ་དང་རྣམ་པར་རྒྱལ་མ་དང་། །དོན་གྲུབ་མ་དང་མི་འཕམ་དང་།
en: “In one area in the east, There are eight goddesses: Jayantī and Vijayantī, Siddhārthā and Aparājitā, “Nandottarā and Nandisenā, Nandinī and Nandavardhanī.

source: །དགའ་མཆོག་མ་དང་དགའ་སྡེ་དང་། །དགའ་ཅན་མ་དང་དགའ་འཕེལ་མ། །དེ་དག་ཁྱེད་ལ་ནད་མེད་ཅིང་། །ཤིས་པར་ལྷག་པར་སྐྱོང་བར་ཤོག
en: May they especially protect you With health and well-being!

source: །ཤར་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན། །གཞི་འཛིན་ཞེས་བྱའི་མཆོད་རྟེན་ཡོད།
en: “In a quarter in the east there is a memorial called Cāpāla,

source: །རྒྱལ་བ་སྐྱོབ་པ་དགྲ་བཅོམ་པ། །དེ་རྣམས་ཀྱིས་ནི་བཞུགས་ཤིང་མཁྱེན།
en: Inhabited and known by victorious ones, protector worthy ones.

source: །དེ་ཡང་ཁྱེད་ལ་ནད་མེད་ཅིང་། །ཤིས་པར་ལྷག་པར་སྐྱོང་གྱུར་ཅིག
en: May they especially protect you With health and well-being!

source: །ཕྱོགས་ན་ཁྱེད་ཅག་བདེ་བར་ཤོག །ཁྱེད་ཅག་སྡིག་པར་མ་གྱུར་ཅིག །ལྷ་རྣམས་ཀུན་གྱིས་རབ་བསྲུངས་ནས།
en: “May the quarters be safe for you! May you not incur evil! May you be protected by all deities,

source: །ནོར་རྣམས་རྙེད་དེ་ལྡོག་པར་ཤོག །དགོས་པ་ལ་ལ་གང་གི་ཕྱིར།
en: And may you return with great profit!

source: །ལྷོ་ཕྱོགས་སུ་ནི་འགྲོ་བ་ན། །གང་དག་ཕྱོགས་དེར་གནས་པ་ཡི། །རྒྱུ་སྐར་ཁྱེད་ལ་སྐྱོང་གྱུར་ཅིག
en: “Should you, for some reason, Have to travel to the south, May the constellations in that direction Protect you!

source: །མཆུ་དང་གྲེ་དང་དབོ་དང་ནི།
en: “Maghā and also The two Phālgunī, Hasta,

source: །མེ་བཞི་ནག་པ་ལྔ་པ་ཡིན།
en: And Citrā, the fifth.

source: །ས་རི་དང་ནི་ས་ག་སྟེ།
en: Along with Svātiś

source: །དེ་དག་རྣམས་ནི་ལྷོ་ཕྱོགས་པ།
en: and Viśākhā, are in the south.

source: །ལྷོ་ཕྱོགས་ལོགས་ན་ཡོད་ཅེས་བསྟན།
en: Dwell in the southern quarter.

source: །འཕགས་སྐྱེས་པོ་ཞེས་བྱ་བར་བརྗོད།
en: Is called Virūḍhaka.

source: །དེ་ནི་གྲུལ་བུམ་ཀུན་གྱི་བདག །གཤིན་རྗེ་ལྷན་ཅིག་སྲུང་བར་ཤོག །དེ་ལ་བུ་ནི་མང་ཡོད་ལ། །མཁས་ཤིང་མིང་ཡང་འཐུན་པ་སྟེ། །དགུ་བཅུ་རྩ་གཅིག་ཟད་པར་ཡང་། །དབང་པོ་ཞེས་བྱ་སྟོབས་པོ་ཆེ། །དེ་རྣམས་ཁྱེད་ལ་ནད་མེད་ཅིང་།
en: May that lord of all kumbhāṇḍas, Together with the lord of death, protect you! “May his many sons, wise and mighty, All ninety-one of whom are called Indra, Especially protect you With health and well-being!

source: །ཤིས་པར་ལྷག་པར་སྐྱོང་གྱུར་ཅིག །ལྷོ་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན། །ལྷ་མོ་གཞོན་ནུ་བརྒྱད་ཡོད་དེ། །དཔལ་ལྡན་མ་དང་གྲགས་ལྡན་མ། །གྲགས་པ་འཐོབ་དང་གྲགས་འཛིན་དང་། །ལེགས་པར་ལངས་དང་རབ་སྔ་དང་། །ལེགས་པར་སད་དང་བདེ་སྒྲུབ་མ།
en: “In one section of the south, There are eight goddesses: Śriyāmatī and Yaśamatī, Yaśaprāptā and Yaśodharā, “Suutthitā and Suprathamā, Suprabuddhā and Sukhavyūhā.

source: །དེ་དག་ཁྱེད་ལ་ནད་མེད་ཅིང་། །ཤིས་པར་ལྷག་པར་སྐྱོང་བར་ཤོག །
en: May they protect you With health and well-being!

source: ལྷོ་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན། །པད་མ་ཞེས་བྱའི་མཆོད་རྟེན་ཡོད། །རྟག་ཏུ་གཟི་བརྗིད་ཀྱིས་ཀྱང་འབར། །རྟག་ཏུ་ཐམས་ཅད་གསལ་བྱེད་པ།
en: “In a section of the south is a Padma memorial, Continually shining with brilliance, always illuminating all.

source: །དེ་ཡང་ཁྱེད་ལ་ནད་མེད་ཅིང་། །ཤིས་པར་ལྷག་པར་སྐྱོང་གྱུར་ཅིག །
en: May it too especially protect you With health and well-being!

source: ཕྱོགས་ན་ཁྱེད་ཅག་བདེ་བར་ཤོག །ཁྱེད་ཅག་སྡིག་པར་མ་གྱུར་ཅིག །ལྷ་རྣམས་ཀུན་གྱིས་རབ་བསྲུངས་ནས། །ནོར་རྣམས་རྙེད་དེ་ལྡོག་པར་ཤོག །
en: “May the quarters be safe for you! May you not incur evil! May all deities protect you, And may you return with great profit!

source: དགོས་པ་ལ་ལ་གང་གི་ཕྱིར། །ནུབ་ཕྱོགས་སུ་ནི་འགྲོ་བ་ན།
en: “Should you, for some reason, Need to travel west,

source: །གང་དག་ཕྱོགས་དེར་གནས་པ་ཡི། །རྒྱུ་སྐར་ཁྱེད་ལ་སྐྱོང་གྱུར་ཅིག
en: May the constellations that dwell in that direction Protect you!

source: ལྷ་མཚམས་དང་ནི་སྣྲོན་དང་ཡང་།
en: “Anurādhā and Jeṣṭhā,

source: །བརྩོན་འགྲུས་བརྟན་ལྡན་སྣྲུམས་དང་ནི།
en: Mūlā and Dṛḍhavīryatā,

source: །ཆུ་སྟོད་ཆུ་སྨད་བྱི་བཞིན་དང་། །
en: Āṣādhas and Abhijit,

source: གྲོ་བཞིན་དེ་ནི་བདུན་པ་ཡིན།
en: And Śravaṇa—these are the seven.

source: །དེ་དག་རྣམས་ནི་ནུབ་ཕྱོགས་པ། །རྒྱུ་སྐར་བདུན་པོ་དེ་དག་ནི། །འཇིག་རྟེན་སྐྱོང་བ་གྲགས་ལྡན་པ། །ནུབ་ཕྱོགས་ལོགས་ན་ཡོད་ཅེས་བསྟན། །དེ་དག་ཁྱེད་ལ་ཀུན་ཏུ་སྲུངས།
en: “These seven constellations, Renowned world protectors, Dwell in the west. May they always protect you!

source: །དེ་དག་བདག་པོ་རྒྱལ་པོ་ནི། །མིག་མི་བཟང་ཞེས་བྱ་བར་ཤེས།
en: “Their lord and king Is known as Virūpākṣa.

source: །དེ་ནི་ཀླུ་རྣམས་ཀུན་གྱི་བདག །ཆུ་ལྷ་ལྷན་ཅིག་སྲུང་བར་ཤོག །དེ་ལ་བུ་ནི་མང་ཡོད་ལ།
en: May that lord of all nāgas, Together with Varūṇa, protect you!

source: །མཁས་ཤིང་མིང་ཡང་འཐུན་པ་སྟེ། །དགུ་བཅུ་རྩ་གཅིག་ཟད་པར་ཡང་། །དབང་པོ་ཞེས་བྱ་སྟོབས་པོ་ཆེ། །དེ་དག་ཁྱེད་ལ་ནད་མེད་ཅིང་། །ཤིས་པར་ལྷག་པར་སྐྱོང་གྱུར་ཅིག །
en: “May his many sons, wise and mighty, All ninety-one of whom are called Indra, Especially protect you With health and well-being!

source: ནུབ་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན། །ལྷ་མོ་གཞོན་ནུ་བརྒྱད་ཡོད་དེ།
en: “In a section of the west, There are eight goddesses:

source: །རྣ་ཆ་སྐྲ་འདྲེས་མ་དང་ནི། །པད་མ་དཀར་དང་སྐྱ་རེང་དང་། །ཆ་མེད་གཅིག་དང་དགུ་པ་དང་། །རོལ་དང་གནག་དང་སྟབས་མྱུར་སྲིད།
en: Alambuśā and Miśrakeśī, Puṇḍarīkā and Āruṇā, “Ekādaśā, Navanāmikā, Śītā, and Kṛṣṇā Draupadī.

source: ནུབ་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན། །ནུབ་ཅེས་བྱ་བའི་རི་བོ་ཡོད།
en: “In a section of the west, there is a mountain called Aṣṭaṃga;

source: །ཉི་མ་ཟླ་བ་རྣམས་ཀྱང་གནས།
en: The sun and the moon also reside there.

source: །ནུབ་པའང་ཁྱེད་ལ་ནོར་སྦྱིན་གྱུར།
en: May that mountain give you wealth

source: །དེ་ཡང་ཁྱེད་ལ་ནད་མེད་ཅིང་།
en: And protect you with health and well-being!

source: །ཤིས་པར་ལྷག་པར་སྐྱོང་གྱུར་ཅིག །ཕྱོགས་ན་ཁྱེད་ཅག་བདེ་བར་ཤོག །ཁྱེད་ཅག་སྡིག་པར་མ་གྱུར་ཅིག །ལྷ་རྣམས་ཀུན་གྱིས་རབ་བསྲུངས་ནས།
en: “May the quarters be safe for you! May you not incur evil! May you be protected by all deities,

source: །བྱང་ཕྱོགས་སུ་ནི་འགྲོ་བ་ན།
en: “If for some reason You should travel to the north,

source: །གང་དག་ཕྱོགས་དེར་གནས་པ་ཡི། །རྒྱུ་སྐར་ཁྱེད་ལ་སྐྱོང་གྱུར་ཅིག །
en: May the constellations in that direction Protect you!

source: མོན་གྲུ་དང་ནི་མོན་གྲེ་དང་། །ཁྲུམས་སྟོད་དང་ཡང་ཁྲུམས་སྨད་དང་། །ནམ་གྲུ་དང་ནི་ཐ་སྐར་དང་། །བྲ་ཉེ་སྟེ་ནི་བདུན་པ་ཡིན།
en: “There are seven: Dhaniṣṭhā, Śatabhiṣā, The pair of Pūrva Aparā and Uttara Aparā, Revatī and Aśvinī and Bharaṇī.

source: །བྱང་ཕྱོགས་ལོགས་ན་ཡོད་ཅེས་བསྟན།
en: Reside in the north.

source: །མི་ལ་ཞོན་པ་ལུས་ངན་པོ།
en: Is Kubera, borne by men.

source: །གནོད་སྦྱིན་ཀུན་གྱི་བདག་པོ་སྟེ།
en: May this lord of all yakṣas,

source: །ནོར་བཟངས་ལྷན་ཅིག་སྲུང་བར་ཤོག །དེ་ལ་བུ་ནི་མང་ཡོད་ལ། །མཁས་ཤིང་མིང་ཡང་འཐུན་པ་སྟེ། །
en: Together with Maṇibhadra, protect you! “May his many sons, wise and mighty,

source: དགུ་བཅུ་རྩ་གཅིག་ཟད་པར་ཡང་། །དབང་པོ་ཞེས་བྱ་སྟོབས་པོ་ཆེ།
en: All ninety-one of whom are called Indra,

source: །དེ་དག་ཁྱེད་ལ་ནད་མེད་ཅིང་། །ཤིས་པར་ལྷག་པར་སྐྱོང་གྱུར་ཅིག །
en: Especially protect you With health and well-being!

source: བྱང་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན།
en: “In a section of the north,

source: །ལྷ་མོ་གཞོན་ནུ་བརྒྱད་ཡོད་དེ།
en: There are eight goddesses:

source: །རབ་ཆགས་ལྷ་མོ་སྟོང་ལྷ་མོ།
en: Ilādevī and Surādevī,

source: །ས་དང་དེ་བཞིན་པད་མ་ཅན།
en: Pṛthvī and Padmāvatī,

source: །རྒྱལ་པོ་ཆེ་ལ་ཉེར་གནས་དང་། །རེ་དང་ཁྲེལ་ཡོད་དཔལ་ལྡན་མ།
en: “Mahārājā, Āśā, Śraddhā, and modest Śirī.

source: །དེ་དག་ཁྱེད་ལ་ནད་མེད་ཅིང་།
en: May they especially protect you

source: །ཤིས་པར་ལྷག་པར་སྐྱོང་བར་ཤོག །
en: With health and well-being!

source: བྱང་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་ན། །སྤོས་ངད་ལྡང་བའི་རི་བོ་ཡོད།
en: “In a section of the north is Mount Gandhamādana.

source: །གནོད་སྦྱིན་འབྱུང་པོ་རྣམས་ཀྱི་གནས།
en: It is the abode of all yakṣas and bhūtas,

source: །རྩེ་མོ་སྣ་ཚོགས་བལྟ་ན་སྡུག །དེ་ཡང་ཁྱེད་ལ་ནད་མེད་ཅིང་།
en: Has many peaks, and is pleasant to behold.

source: །ནོར་རྣམས་རྙེད་དེ་ལྡོག་པར་ཤོག །རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བརྒྱད་པོ། །ཕྱོགས་བཞི་དག་ན་བདུན་བདུན་གནས། །ལྷ་ཡི་བུ་མོ་སུམ་ཅུ་གཉིས། །ཕྱོགས་བཞི་དག་ན་བརྒྱད་བརྒྱད་གནས།
en: “The twenty-eight constellations, Seven dwelling in each of the four directions, The thirty-two goddesses, Eight dwelling in each of the four directions,

source: །དགེ་སྦྱོང་བརྒྱད་དང་བྲམ་ཟེ་བརྒྱད། །ཡུལ་རྣམས་ན་ནི་གྲོང་རྡལ་བརྒྱད། །དབང་པོར་བཅས་པའི་ལྷ་བརྒྱད་རྣམས། །དེ་དག་ཁྱེད་ལ་ཀུན་ཏུ་སྲུངས།
en: “The eight renunciates, the eight priests, The eight towns throughout the lands, And the eight gods, together with their Śakras, May they all protect you!

source: །ཁྱེད་ཅག་འགྲོ་ནའང་བཀྲ་ཤིས་གྱུར།
en: “May you have good fortune going!

source: །ལྡོག་པ་ན་ཡང་བཀྲ་ཤིས་ཤོག །
en: May you have good fortune returning!

source: གཉེན་ལ་ལྟ་བ་བཀྲ་ཤིས་གྱུར།
en: May you have the good fortune of beholding your kinfolk!

source: །གཉེན་གྱིས་བལྟ་བའང་བཀྲ་ཤིས་ཤོག །
en: May you have the good fortune of being beheld by your kinfolk!

source: དབང་བཅས་གནོད་སྦྱིན་རྒྱ་ཆེན་དང་། །དགྲ་བཅོམ་པ་དག་སྙིང་བརྩེ་བས།
en: “Lovingly cared for by numerous yakṣas with their Śakras And by the worthy ones,

source: །ཐམས་ཅད་དུ་ནི་བཀྲ་ཤིས་དང་། །བདུད་རྩི་ཤིས་པ་ཐོབ་པར་ཤོག །ཚངས་པ་དང་ནི་དེ་བཞིན་ནོར་རྒྱས་དང་། །ཟག་པ་མེད་པ་རྣམ་པར་གྲོལ་རྣམས་དང་། །ཀླུ་དང་གནོད་སྦྱིན་རྟག་ཏུ་སྙིང་བརྩེས་བསྲུང་། །སྟོན་བརྒྱར་མཚུངས་པར་ཚེ་ནི་སྐྱོང་བར་ཤོག །
en: May you travel happily everywhere And obtain the auspicious nectar. “Always lovingly protected by Brahmā and Vāsava, And by those free of outflows whose minds are liberated, And also by the nāgas and yakṣas, May your lives be preserved for one hundred autumns!”

source: རྣམ་འདྲེན་ཟླ་མེད་འཇིག་རྟེན་མགོན་པོ་ཡིས།
en: The Peerless Guide, Lord of the World,

source: །དེ་དག་འཐུན་པར་སྦྱིན་པའི་བསྔགས་པ་གསུངས།
en: Then lauded their offerings as fortuitous, saying,

source: །ཁྱེད་རྣམས་ཀྱི་ནི་དགེ་བའི་ལས་འདི་ཡིས།
en: “Through this virtuous deed,

source: །སྦྲང་རྩི་འབྱུང་ཞེས་བྱ་བའི་རྒྱལ་བར་འགྱུར།
en: You will become victorious ones known as Madhusaṃbhava!”

source: །འཇིག་རྟེན་རྣམ་པར་འདྲེན་པ་རྒྱལ་བ་ཡིས། །ལུང་བསྟན་ཆགས་མེད་འདི་ནི་དང་པོ་ཡིན།
en: This was the first prophecy made By the Victorious One, the Guide of the World.

source: །ཕྱིན་ཆད་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་མང་། །གང་དག་ལུང་བསྟན་དེ་དག་ཕྱིར་མི་ལྡོག །རྒྱལ་བས་ལུང་བསྟན་པ་ནི་འདི་ཐོས་ནས།
en: The infinitely many bodhisattvas that were prophesied later Cannot possibly turn back from awakening. When they heard the Victorious One’s prophecy,

source: །སེམས་ནི་མགུ་ཞིང་མཆོག་ཏུ་དགའ་གྱུར་ཏེ།
en: The two brothers were elated and supremely pleased.

source: །དེ་དག་སྤུན་དང་གྲོགས་དང་ལྷན་ཅིག་ཏུ།
en: Together with their companions,

source: །དེ་དག་སངས་རྒྱས་ཆོས་ལ་སྐྱབས་སུ་དོང་།
en: They went for refuge in the Buddha and the Dharma.

source: །ག་གོན་དང་བཟང་པོའི་ལེའུ་ཞེས་བྱ་བ་སྟེ། ཉི་ཤུ་རྩ་བཞི་པའོ།། །།
en: This concludes the twenty-fourth chapter, on Trapuṣa and Bhallika.

source: དགེ་སློང་དག་ད་ལྟར་དེ་བཞིན་གཤེགས་པ་ཤིང་སྒྲོལ་རྒྱུའི་དྲུང་ན་བཞུགས་པ་དང་པོ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་གཅིག་པུ་དབེན་པར་གཤེགས་ཏེ། ནང་དུ་ཡང་དག་བཞག་ནས་འཇིག་རྟེན་དང་འཐུན་པར་མཛད་པའི་ཕྱིར་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: Monks, while the Thus-Gone One was seated at the foot of the Bodhi tree, in the privacy of solitude after he had first attained perfect and complete awakening, he had the following thought about the conventions of the world:

source: ཀྱེ་མ་ངས་ཐོབ་ཅིང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་འདི་ནི་ཟབ་པ། ཞི་བ། རབ་ཏུ་ཞི་བ། ཉེ་བར་ཞི་བ། གྱ་ནོམ་པ། མཐོང་བར་དཀའ་བ། ཁོང་དུ་ཆུད་པར་དཀའ་བ། བརྟག་མི་ནུས་པ་རྟོག་གེའི་སྤྱོད་པ་མ་ཡིན་པ།
en: “Alas! This truth that I realized and awakened to is profound, peaceful, tranquil, calm, complete, hard to see, hard to comprehend, and impossible to conceptualize since it is inaccessible to the intellect.

source: འཕགས་པ་མཁས་པ་དང་མཛངས་པས་རིག་པ་སྟེ།
en: Only wise noble ones and adepts can understand it.

source: འདི་ལྟ་སྟེ་ཕུང་པོ་ཐམས་ཅད་བོར་བ་ཀུན་ཏུ་རིག་པ། ངེས་པར་རིག་པ། ཚོར་བ་ཐམས་ཅད་འགོག་པ། དོན་དམ་པ། ཀུན་གཞི་མེད་པ།
en: It is the complete and definitive apprehension of the abandonment of all aggregates, the end of all sensations, the absolute truth, and freedom from a foundation.

source: བསིལ་བའི་དངོས་པོ། ལེན་པ་མེད་པ། ཉེ་བར་ལེན་པ་མེད་པ། རྣམ་པར་རིག་པ་མ་ཡིན་པ། རྣམ་པར་རིག་པར་བྱ་བ་མ་ཡིན་པ། འདུས་མ་བྱས་པ་ཡུལ་དྲུག་ལས་ཤིན་ཏུ་འདས་པ།
en: It is a state of complete peace, free of clinging, free of grasping, unobserved, undemonstrable, uncompounded, beyond the six sense fields, inconceivable, unimaginable, and ineffable.

source: མི་རྟོག་པ་རྣམ་པར་མི་རྟོག་པ། བརྗོད་དུ་མེད་པ་སྒྲ་མེད་པ། སྒྲས་བརྗོད་དུ་མེད་པ།
en: It is indescribable, inexpressible, and incapable of being illustrated.

source: བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ། དམིགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ། ཞི་གནས་ཀྱི་ལམ་གྱིས་ཆོད་པ། སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པ།
en: It is unobstructed, beyond all references, a state of interruption through the path of tranquility, and imperceptible like emptiness.

source: སྲེད་པ་ཟད་པ། འདོད་ཆགས་དང་བྲལ་བ་འགོག་པ་མྱ་ངན་ལས་འདས་པ་སྟེ།
en: It is the exhaustion of craving and it is cessation free of desire. It is nirvāṇa.

source: གལ་ཏེ་བདག་གིས་ཆོས་འདི་གཞན་དག་ལ་བསྟན་ལ། གལ་ཏེ་དེ་དག་གིས་མ་ཤེས་ན།
en: If I were to teach this truth to others, they would not understand it.

source: དེ་ནི་བདག་ངལ་བ་དང་། ལོག་པར་བརྩལ་བ་དང་། ཆོས་བསྟན་པ་དོན་མེད་པར་འགྱུར་གྱི།
en: Teaching the truth would tire me out and be wrongly contested, and it would be futile.

source: བདག་སྙིང་ལས་ཆུང་ངུར་ཁ་རོག་པར་གནས་པར་བྱ་སྙམ་མོ།
en: Thus I will remain silent and keep this truth in my heart.”

source: །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: At that time he uttered these verses:

source: །ཟབ་ཞི་རྡུལ་བྲལ་འོད་གསལ་འདུས་མ་བྱས།
en: “Profound, peaceful, stainless, lucid, and unconditioned—

source: །བདུད་རྩི་ཆོས་ནི་བདག་གིས་ཐོབ་པར་གྱུར།
en: Such is the nectar-like truth I have realized.

source: །བདག་གིས་བསྟན་ཀྱང་གཞན་གྱིས་མི་ཤེས་ཏེ།
en: Were I to teach it, no one would understand,

source: །མི་སྨྲར་ནགས་འདབས་གནས་པར་བྱ་བ་སྙམ།
en: So I will silently remain in the forest.

source: །ཚིག་བྲལ་ངག་གི་ལམ་གྱིས་མི་གོས་པ།
en: “I have discovered the supremely sublime and astonishing absolute,

source: །དེ་བཞིན་ཉིད་ཆོས་རང་བཞིན་ནམ་མཁའ་འདྲ།
en: The ineffable state, untainted by language,

source: །སེམས་དང་ཡིད་ཀྱིས་རྒྱུ་བ་རབ་གྲོལ་བ། །
en: Suchness, the sky-like nature of phenomena,

source: མཆོག་རབ་ངོ་མཚར་ཆེ་བ་དམ་པ་ཤེས།
en: Completely free of discursive, conceptual movement.

source: །དོན་ཚུལ་འདི་ནི་ཡི་གེ་རྣམས་ཀྱིས་སུ། །ཤེས་པར་མི་ནུས་མཛངས་པས་རིག་པ་ཡིན། །སྔོན་གྱི་རྒྱལ་ལ་ལྷག་བྱས་སེམས་ཅན་རྣམས།
en: “This meaning cannot be understood through words; Rather it is comprehended through reaching their limit. Yet when sentient beings, whom previous victorious ones took under their care,

source: །དེ་དག་ཆོས་འདི་ཐོས་ན་ཡིད་ཆེས་འགྱུར།
en: Hear about this truth, they develop confidence in it.

source: །འདི་ན་ཆོས་ནི་གང་ཡང་ཡོད་མིན་ཏེ།
en: “No Dharma at all exists here;

source: །ཡོད་མེད་གང་ཡིན་དེ་ནི་ཡོད་མ་ཡིན།
en: That which has no existence cannot be found.

source: །གང་གིས་རྒྱུ་དང་བྱ་བ་བརྒྱུད་ཤེས་པ།
en: For one who knows the chain of causation and action,

source: །དེ་ལ་ཡོད་པའམ་མེད་པ་ཡོད་མ་ཡིན།
en: There is neither existence nor nonexistence here.

source: །བསྐལ་པ་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པར་ནི།
en: “For immeasurable hundreds of thousands of eons,

source: །སྔོན་གྱི་རྒྱལ་བའི་གན་ནས་བདག་གིས་སྤྱད།
en: I emulated the previous victorious ones,

source: །འོན་ཀྱང་གང་ན་བདག་དང་སེམས་ཅན་དང་། །སྲོག་མེད་བཟོད་པ་དེ་ནི་བདག་མ་ཐོབ།
en: But I did not attain forbearance In which there is no self, no sentient being, and no life force.

source: །གང་ཚེ་འདི་ན་སྐྱེ་འཆི་གང་མེད་པ། །ཆོས་འདི་ཐམས་ཅད་རང་བཞིན་བདག་མེད་པའི། །བཟོད་འདི་བདག་གིས་ཐོབ་པ་དེ་ཡི་ཚེ། །སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་བདག་ལུང་བསྟན།
en: “When I attained this forbearance That nobody dies or is born here, That the nature of all these phenomena is to be without self, Then Buddha Dīpaṃkara made a prophecy about me.

source: །འཇིག་རྟེན་ཀུན་ལ་སྙིང་རྗེ་མཐའ་ཡས་ང་།
en: “With my infinite compassion for the whole world,

source: །གཞན་གྱིས་གསོལ་བ་བཏབ་ལ་ང་མི་སྡོད།
en: I do not hesitate when others supplicate me.

source: །སྐྱེ་བོ་འདི་དག་ཚངས་ལ་དད་པ་སྟེ། །དེ་ཡིས་གསོལ་བ་བཏབ་ན་འཁོར་ལོ་བསྐོར།
en: These beings all have faith in Brahmā; Thus, when he supplicates, I will turn the wheel of Dharma. “It would only be suitable to bring forth this Dharma of mine

source: །གལ་ཏེ་ཚངས་པས་ང་ཡི་རྐང་པར་གཏུགས།
en: If Brahmā were to fall at my feet,

source: །རྣམ་པ་བཟང་པོ་འཚལ་འགྱུར་སེམས་ཅན་མཆིས།
en: Supplicating me to explain the stainless and sublime Dharma,

source: །རྡུལ་བྲལ་གྱ་ནོམ་ཆོས་ཤོད་གསོལ་བཏབ་ན། །དེ་ལྟས་ང་ཡི་ཆོས་འདི་གཟུང་འོས་འགྱུར།
en: And if there were intelligent beings of good disposition.”

source: །དགེ་སློང་དག་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་དེའི་ཚེ་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་འོད་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་འགྱུར་བའི་འོད་ཕྱུང་ངོ་།
en: Monks, at that time the Thus-Gone One radiated light from the center of his forehead, which illuminated the entire trichiliocosm with its brilliance.

source: །དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་བདག་པོ་ཚངས་པ་ཆེན་པོ་གཙུག་ཕུད་ཅན་སངས་རྒྱས་ཀྱི་མཐུས་དེ་བཞིན་གཤེགས་པའི་ཐུགས་ཀྱི་རྣམ་པར་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ཏེ།
en: Then, by means of the Buddha’s power, Great Top-Knotted Brahmā, lord of the trichiliocosm, became aware of the Thus-Gone One’s notion.

source: བཅོམ་ལྡན་འདས་ཐུགས་ལས་ཆུང་ངུ་ལ་ཐུགས་བཏུད་ཅིང་ཆོས་མི་སྟོན་པར་ཤེས་ནས། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་སོང་ལ་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བསྐུལ་གོར་མ་ཆག་སྙམ་མོ།
en: Having understood that the Blessed One was set on keeping the Dharma to himself without teaching it, he thought, “I will most certainly approach and solicit the Thus-Gone One to turn the wheel of Dharma!”

source: །དེ་ནས་ཚངས་པ་གཙུག་ཕུད་ཅན་གྱིས་དེའི་ཚེ། དེ་མ་ཡིན་པ་ཚངས་རིས་ཀྱི་ལྷའི་བུ་གཞན་དག་ལ་སྨྲས་པ།
en: So right then Great Top-Knotted Brahmā addressed the other gods of the Brahma realms:

source: གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། འདི་ལྟར་ཆོས་མི་སྟོན་པར་ཐུགས་ལས་ཆུང་ངུ་ལ་ཐུགས་བཏུད་པས།
en: “Friends! Even though the Thus-Gone One has awakened to unsurpassable, perfect and complete buddhahood, he is set on keeping the Dharma to himself without teaching it. Alas!

source: ཀྱེ་མ་འཇིག་རྟེན་འདི་ནི་མ་རུང་ངོ་།
en: This world is doomed!

source: །གྲོགས་པོ་དག་ཀྱེ་མ་འཇིག་རྟེན་འདི་ནི་རྣམ་པར་མ་རུང་ངོ་།
en: Alas, O friends, this world is really doomed!

source: །བདག་ཅག་དོང་སྟེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བསྐུལ་གོར་མ་ཆག་གོ།
en: Thus we must surely go and solicit the worthy one, the perfectly and completely awakened Thus-Gone One, to turn the wheel of Dharma.”

source: །དགེ་སློང་དག་དེ་ནས་ཚངས་པ་ཆེན་པོ་གཙུག་ཕུད་ཅན་ཚངས་པ་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཀྱིས་བསྐོར་ཏེ། མདུན་དུ་བདར་ནས་དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཐལ་མོ་སྦྱར་ནས་དེ་བཞིན་གཤེགས་པ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Monks, then the Great Top-Knotted Brahmā, surrounded and escorted by six million eight hundred thousand Brahmās, went to the Thus-Gone One. When he arrived, he bowed his head to the feet of the Thus-Gone One, and with palms joined, said to him,

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་ཆོས་མི་སྟོན་པར་ཐུགས་ལས་ཆུང་ངུ་ལ་ཐུགས་བཏུད་པས་ཀྱེ་མའོ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་འདི་ནི་མ་རུང་ངོ་།
en: “Thus-Gone One, even having awakened to unexcelled, perfect, and complete awakening, you are bent on keeping the Dharma to yourself without teaching it.
